app/controllers/songs_controller.rb

  def new
    @action = :new
    if params[:artist_id].present?
      redirect_to artists_path unless Artist.exists?(params[:artist_id])
      @artist = Artist.find_by(id: params[:artist_id])
---
SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @action = :edit
    if params[:artist_id].present?
      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path
      else
        artist = Artist.find_by(id: params[:artist_id])
        redirect_to artist_songs_path unless artist.songs.find_by(id: params[:id])
---
SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]